package praktikum.Core2.UnitTest;

public class Main {
    static final String BOUNDARY_VALUES = "Граничные значения";
    static final String EQUIVALENCE_CLASS = "Параметры, при которых программа ведет себя одинаково";

    public static void main(String[] args) {
        /*
        Если какую-то часть продукта сложно протестировать, значит,
        возможно, она реализована неочевидным образом,
        и её стоит переписать. И наоборот: программу,
        которую легко протестировать, скорее всего, также легко понять.

        1 тест на каждое из граничных значениц + 1 для каждого промежутка эквивалентности
         */



    }
}
